app/views/tasks/index.html.erb

<footer>
    <h1>現在の日時：<%= I18n.l(Date.today, format: :long) %> スケジュール合計：<%= Task.count %></h1>
---
SELECT `tasks`.* FROM `tasks`
SELECT COUNT(*) FROM `tasks`