app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`title`, `memo`, `startday`, `endday`, `allday`, `created_at`, `updated_at`) VALUES ('ohayou', 'fe', '2021-04-26', '2021-04-26', TRUE, '2021-04-26 01:24:00', '2021-04-26 01:24:00')

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE `tasks` SET `memo` = 'dcccc', `updated_at` = '2021-05-01 02:40:19' WHERE `tasks`.`id` = 2

  def destroy
    @task.destroy
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 1

    def set_task
      @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1